# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [12]:
import pandas as pd

In [13]:
data = [4, 8, 15, 16, 23, 42]
series = pd.Series(data)

print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [33]:
list = [11,21,31,33,44,55,77,99,108,360]

series = pd.Series(list)

print(series)

0     11
1     21
2     31
3     33
4     44
5     55
6     77
7     99
8    108
9    360
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data:

| Name   | Age | Gender |
|--------|-----|--------|
| Alice  | 25  | Female |
| Bob    | 30  | Male   |
| Claire | 27  | Female |

        
# Then, print the DataFrame.

In [15]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}

df = pd.DataFrame(data)

print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns). It is similar to a spreadsheet or a SQL table and can store data of various types, including numbers, strings, and more. DataFrames are one of the most commonly used data structures in Pandas, and they provide a powerful way to work with structured data.

A Pandas Series is a one-dimensional array-like object that can hold data of any type. A Series is essentially a single column of data with an associated label, called the index. Series are the building blocks of DataFrames.

**Differences Between DataFrame and Series**

| Characteristic               | DataFrame                            | Series                                |
|-----------------------------|--------------------------------------|---------------------------------------|
| Dimensionality              | Two-dimensional (rows and columns)   | One-dimensional (single column or row)|
| Data Structure              | Tabular structure with multiple columns, each potentially holding different types of data. | A single column of data with an index. |
| Index                       | Has both a row index and a column index. | Has an index but no column index. |
| Size Mutability             | You can add or remove columns easily, making it size-mutable. | Generally, its size is fixed. |
| Common Operations           | Supports operations on entire tables, like filtering, grouping, and merging. | Supports operations on individual columns or rows. |

In [21]:
data = {
    'emp_id':[11,12,13],
    'name':['Ram','Raj','Sita'],
    'dept':['Marketing','finance','Operation'],
}

data_frame = pd.DataFrame(data)
data_frame

   emp_id  name       dept
0      11   Ram  Marketing
1      12   Raj    finance
2      13  Sita  Operation

In [37]:
data_frame['name']

0     Ram
1     Raj
2    Sita
Name: name, dtype: object

In [38]:
type(data_frame['name'])

pandas.core.series.Series

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [52]:
# created the sample dataframe 
data1 = {'name': ['Ram', 'Raj', 'Nana', 'Ved', 'Hari'],
        'age': [25,None, 40, 35,23],
        'city': ['Pune', 'Mumbai', 'Delhi', 'Banaras', None,],
        'Purchase': ['shampoo', 'powder', 'shampoo', 'bread', 'powder'],
        'sales': [1400, 1200, 11250, 5150, 3450],
        }
df1 = pd.DataFrame(data1)
df1

   name   age     city Purchase  sales
0   Ram  25.0     Pune  shampoo   1400
1   Raj   NaN   Mumbai   powder   1200
2  Nana  40.0    Delhi  shampoo  11250
3   Ved  35.0  Banaras    bread   5150
4  Hari  23.0     None   powder   3450

1. Dropping Data:-

drop(): Allows you to drop rows or columns from the DataFrame.

In [56]:
a=df1.dropna()
a

   name   age     city Purchase  sales
0   Ram  25.0     Pune  shampoo   1400
2  Nana  40.0    Delhi  shampoo  11250
3   Ved  35.0  Banaras    bread   5150

2. fillna(): Fills missing values with a specified value or method.

In [58]:
b=df1.fillna(0)
b

   name   age     city Purchase  sales
0   Ram  25.0     Pune  shampoo   1400
1   Raj   0.0   Mumbai   powder   1200
2  Nana  40.0    Delhi  shampoo  11250
3   Ved  35.0  Banaras    bread   5150
4  Hari  23.0        0   powder   3450

3. Sorting:

sort_values(): Sorts the DataFrame by one or more columns.

In [65]:
c=df1.sort_values(by='city',ascending=True)
c

   name   age     city Purchase  sales
3   Ved  35.0  Banaras    bread   5150
2  Nana  40.0    Delhi  shampoo  11250
1   Raj   NaN   Mumbai   powder   1200
0   Ram  25.0     Pune  shampoo   1400
4  Hari  23.0     None   powder   3450

4. groupby(): Groups data based on a column and allows you to perform aggregation functions.

In [75]:
d=df1.groupby('Purchase')['age'].mean()
d

Purchase
bread      35.0
powder     23.0
shampoo    32.5
Name: age, dtype: float64

5. assign(): Adds new columns to the DataFrame.

In [78]:
e=df1.assign(Doubled_sales=df1['sales'] * 2)
e

   name   age     city Purchase  sales  Doubled_sales
0   Ram  25.0     Pune  shampoo   1400           2800
1   Raj   NaN   Mumbai   powder   1200           2400
2  Nana  40.0    Delhi  shampoo  11250          22500
3   Ved  35.0  Banaras    bread   5150          10300
4  Hari  23.0     None   powder   3450           6900

6. Filtering:

boolean indexing: Allows you to filter rows based on a condition.

In [79]:
g=df1[df1['age']>30]
g

   name   age     city Purchase  sales
2  Nana  40.0    Delhi  shampoo  11250
3   Ved  35.0  Banaras    bread   5150

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series: It is a 1-D size-immutable array like structure having homogeneous data.

DataFrames: It is a 2-D size-mutable tabular structure with heterogeneously typed columns.

Panel: It is a 3-D, size-mutable array. Panel has been deprecated in more recent versions of Pandas.

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [49]:
import pandas as pd

name= pd.Series(['ram','raj','amar'])
age= pd.Series([23,45,31])
item_purchase=pd.Series(['nirma','shampoo','fruits'])

data_frame=pd.DataFrame({
    'name':name,
    'age':age,
    'purchase':item_purchase
    
}
)
data_frame

   name  age purchase
0   ram   23    nirma
1   raj   45  shampoo
2  amar   31   fruits